In [1]:
%load_ext sql
%sql mysql+mysqlconnector://blackbasil:Naveen%402193@localhost/

In [2]:
%%sql
use de_project;

 * mysql+mysqlconnector://blackbasil:***@localhost/
0 rows affected.

[]

In [3]:
%%sql
CREATE TABLE CustomerData (
    id INT PRIMARY KEY,
    customer_name VARCHAR(100),
    email VARCHAR(100),
    phone_number VARCHAR(15),
    address VARCHAR(200),
    amount DECIMAL(10, 2)
);
INSERT INTO CustomerData (id, customer_name, email, phone_number, address, amount) VALUES
(1, 'Alice Johnson', 'alice.johnson@example.com', '9876543210', '123 Main Street, Chennai', 1500.00),
(2, 'Bob Smith', 'bob.smith@example.com', '9123456789', '45 Park Avenue, Bangalore', 3200.75),
(3, 'Charlie Davis', 'charlie.davis@example.com', '9988776655', '78 MG Road, Delhi', 499.99),
(4, 'Diana Evans', 'diana.evans@example.com', '9090909090', '21 Green Street, Mumbai', 10250.50),
(5, 'Ethan Moore', 'ethan.moore@example.com', '9000012345', '88 Riverbank, Hyderabad', 875.00);

 * mysql+mysqlconnector://blackbasil:***@localhost/
0 rows affected.
5 rows affected.

[]

In [11]:
%%sql 
select *  from CustomerData limit 2;

 * mysql+mysqlconnector://blackbasil:***@localhost/
2 rows affected.

[(1, 'Alice Johnson', 'alice.johnson@example.com', '9876543210', '123 Main Street, Chennai', Decimal('1500.00')),
 (2, 'Bob Smith', 'bob.smith@example.com', '9123456789', '45 Park Avenue, Bangalore', Decimal('3200.75'))]

In [5]:
%%sql
select
    customer_name,
    amount,
    case
        when amount > 4000 then 'High Spender'
        when amount between 2000 and 4000 then 'Medium Spender'
        when amount<= 2000 then 'Low Spender'
    else 'no data'
    end as spending
from CustomerData

 * mysql+mysqlconnector://blackbasil:***@localhost/
5 rows affected.

[('Alice Johnson', Decimal('1500.00'), 'Low Spender'),
 ('Bob Smith', Decimal('3200.75'), 'Medium Spender'),
 ('Charlie Davis', Decimal('499.99'), 'Low Spender'),
 ('Diana Evans', Decimal('10250.50'), 'High Spender'),
 ('Ethan Moore', Decimal('875.00'), 'Low Spender')]

In [10]:
%%sql

select 

customer_name,
case
    when email is null and phone_number is null then '9999'
    when phone_number is null  then email
    else phone_number
    end as contact 
from CustomerData;

 * mysql+mysqlconnector://blackbasil:***@localhost/
5 rows affected.

[('Alice Johnson', '9876543210'),
 ('Bob Smith', '9123456789'),
 ('Charlie Davis', '9988776655'),
 ('Diana Evans', '9090909090'),
 ('Ethan Moore', '9000012345')]